oderwat.indent-rainbow
mechatroner.rainbow-csv
mosapride.zenkaku
christian-kohler.path-intellisense
johnpapa.vscode-peacock
hediet.vscode-drawio
ms-ceintl.vscode-language-pack-ja
esbenp.prettier-vscode
eamodio.gitlens
streetsidesoftware.code-spell-checker
aaron-bond.better-comments
yzhang.markdown-all-in-one
formulahendry.auto-rename-tag
