#!/bin/zsh


# ------------------------------------------------------------------------
# Dockの自動隠し遅延をなくす
# ------------------------------------------------------------------------
echo "💪 Setting dock auto-hide delay..."
defaults write com.apple.dock autohide-delay -float 0

# ------------------------------------------------------------------------
# Dockの自動表示・非表示を有効にする
# ------------------------------------------------------------------------
echo "💪 Enabling dock auto-hide..."
defaults write com.apple.dock autohide -bool true

# ------------------------------------------------------------------------
# Dockのサイズ設定
# ------------------------------------------------------------------------
echo "💪 Setting dock size..."
defaults write com.apple.dock tilesize -int 70

# ------------------------------------------------------------------------
# ScreenShotの保存先変更
# ------------------------------------------------------------------------
echo "💪 Changing destination of ScreenShot..."
defaults write com.apple.screencapture location ~/Desktop/Screenshot

# ------------------------------------------------------------------------
# 設定の反映
# ------------------------------------------------------------------------
killall Dock
killall SystemUIServer
